{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "embeddings_regularizer": null, "batch_input_shape": [null, 300], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "input_length": null, "embeddings_constraint": null, "input_dim": 52317, "trainable": false, "activity_regularizer": null, "output_dim": 100, "mask_zero": false, "name": "embedding_1"}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [5], "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "strides": [1], "name": "conv1d_1"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "padding": "valid", "name": "max_pooling1d_1", "trainable": true, "strides": [5]}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [5], "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "strides": [1], "name": "conv1d_2"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "padding": "valid", "name": "max_pooling1d_2", "trainable": true, "strides": [5]}}, {"class_name": "Conv1D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [5], "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "strides": [1], "name": "conv1d_3"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "padding": "valid", "name": "max_pooling1d_3", "trainable": true, "strides": [5]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 400, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 5, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}]}